# -*- coding: utf-8 -*-
# This is 3.5 version !!

# each dic entry is sorted - longest string first, shortest the last
sanHK = {}
sanHK['a'] = [
    # akSaratrayam
    ( 'ं a','म् अ'),
    #akSaradvayam
    ( 'कa','का'),( 'खa','खा'),( 'गa','गा'),( 'घa','घा'),( 'ङa','ङा'),
    ( 'चa','चा'),( 'छa','छा'),( 'जa','जा'),( 'झa','झा'),( 'ञa','ञा'),( 'टa','टा'),
    ( 'ठa','ठा'),( 'डa','डा'),( 'ढa','ढा'),( 'णa','णा'),( 'तa','ता'),( 'थa','था'),
    ( 'दa','दा'),( 'धa','धा'),( 'नa','ना'),( 'पa','पा'),( 'फa','फा'),( 'बa','बा'),
    ( 'भa','भा'),( 'मa','मा'),( 'यa','या'),( 'रa','रा'),( 'लa','ला'),( 'वa','वा'),
    ( 'शa','शा'),( 'षa','षा'),( 'सa','सा'),( 'हa','हा'),( 'क्षa','क्षा'),( 'ळa','ळा'),
    ( 'अa','आ'),( 'क्a','क'),( 'ख्a','ख'),( 'ग्a','ग'),( 'घ्a','घ'),( 'ङ्a','ङ'),
    ( 'च्a','च'),( 'छ्a','छ'),( 'ज्a','ज'),( 'झ्a','झ'),( 'ञ्a','ञ'),( 'ट्a','ट'),( 'ठ्a','ठ'),
    ( 'ड्a','ड'),( 'ढ्a','ढ'),( 'ण्a','ण'),( 'त्a','त'),( 'थ्a','थ'),( 'द्a','द'),( 'ध्a','ध'),
    ( 'न्a','न'),( 'प्a','प'),( 'फ्a','फ'),( 'ब्a','ब'),( 'भ्a','भ'),( 'म्a','म'),( 'य्a','य'),
    ( 'र्a','र'),( 'ल्a','ल'),( 'व्a','व'),( 'श्a','श'),( 'ष्a','ष'),( 'स्a','स'),( 'ह्a','ह'),
    ( 'क्ष्a','क्ष'),( 'ज्ञ्a','ज्ञ'),( 'ळ्a','ळ'),
    # ekAkSaram
    ( 'a','अ')]

sanHK['A'] =  [
    # akSaratrayam
    ( 'ं A','म् आ'),
    #akSaradvayam
    ( 'क्A','का'),( 'ख्A','खा'),( 'ग्A','गा'),( 'घ्A','घा'),( 'ङ्A','ङा'),
    ( 'च्A','चा'),( 'छ्A','छा'),( 'ज्A','जा'),( 'झ्A','झा'),( 'ञ्A','ञा'),( 'ट्A','टा'),( 'ठ्A','ठा'),
    ( 'ड्A','डा'),( 'ढ्A','ढा'),( 'ण्A','णा'),( 'त्A','ता'),( 'थ्A','था'),( 'द्A','दा'),( 'ध्A','धा'),
    ( 'न्A','ना'),( 'प्A','पा'),( 'फ्A','फा'),( 'ब्A','बा'),( 'भ्A','भा'),( 'म्A','मा'),( 'य्A','या'),
    ( 'र्A','रा'),( 'ल्A','ला'),( 'व्A','वा'),( 'श्A','शा'),( 'ष्A','षा'),( 'स्A','सा'),( 'ह्A','हा'),
    ( 'क्ष्A','क्षा'),( 'ज्ञ्A','ज्ञा'),( 'ळ्A','ळा'),
    # ekAkSaram
    ( 'A','आ'),]

sanHK['b'] = [
    # akSaratrayam
    ( 'म् b','ं ब्'),
    #akSaradvayam
    ( 'न्b', 'म्ब्' ),
    ( 'ंb', 'म्ब्' ),
    # ekAkSaram
    ( 'b','ब्')]

sanHK['B'] = [('B','')]  ## udAsInaM kuru

sanHK['c'] = [
    # akSaratrayam
    ( 'म् c','ं च्'),
    #akSaradvayam
    ( 'न्c', 'ञ्च्' ),
    ( 'ंc', 'ञ्च्' ),
    # ekAkSaram
    ( 'c','च्')]

sanHK['C'] = [('C','')]  ## udAsInaM kuru

sanHK['d'] = [
    # akSaratrayam
    ( 'म् d','ं द्'),
    #akSaradvayam
    ( 'न्d', 'न्द्' ),
    ( 'ंd', 'न्द्' ),
    # ekAkSaram
    ( 'd','द्')]

sanHK['D'] = [
    # akSaratrayam
    ( 'म् D','ं ङ्'),
    #akSaradvayam
    ( 'न्D', 'ण्ड्' ),
    ( 'ंD', 'ण्ड्' ),
    # ekAkSaram
    ( 'D','ड्')]

sanHK['e'] = [
    # akSaratrayam
    ( 'ं e','म् ए'),
    #akSaradvayam
    ( 'क्e','के'),( 'ख्e','खे'),( 'ग्e','गे'),( 'घ्e','घे'),( 'ङ्e','ङे'),( 'च्e','चे'),( 'छ्e','छे'),
    ( 'ज्e','जे'),( 'झ्e','झे'),( 'ञ्e','ञे'),( 'ट्e','टे'),( 'ठ्e','ठे'),( 'ड्e','डे'),( 'ढ्e','ढे'),
    ( 'ण्e','णे'),( 'त्e','ते'),( 'थ्e','थे'),( 'द्e','दे'),( 'ध्e','धे'),( 'न्e','ने'),( 'प्e','पे'),
    ( 'फ्e','फे'),( 'ब्e','बे'),( 'भ्e','भे'),( 'म्e','मे'),( 'य्e','ये'),( 'र्e','रे'),( 'ल्e','ले'),
    ( 'व्e','वे'),( 'श्e','शे'),( 'ष्e','षे'),( 'स्e','से'),( 'ह्e','हे'),( 'क्ष्e','क्षे'),( 'ज्ञ्e','ज्ञे'),
    ( 'ळ्e','ळे'),
    # ekAkSaram
    ( 'e','ए'),]

sanHK['E'] = [('E','')]  ## udAsInaM kuru
sanHK['f'] = [('f','')]  ## udAsInaM kuru
sanHK['F'] = [('F','')]  ## udAsInaM kuru

sanHK['g'] = [
    # akSaratrayam
    ( 'म् g','ं ग्'),
    #akSaradvayam
    ( 'न्g', 'ङ्ग्' ),
    ( 'ंg', 'ङ्ग्' ),
    # ekAkSaram
    ( 'g','ग्')]

sanHK['G'] = [( 'G','ङ्')]

sanHK['h'] = [
    # akSaratrayam
    ( 'म् h','ं ह्'),
    #akSaradvayam
    ( 'क्h','ख्'),( 'ग्h','घ्'),( 'च्h','छ्'),( 'ज्h','झ्'),( 'ट्h','ठ्'),( 'ड्h','ढ्'),( 'त्h','थ्'),
    ( 'द्h','ध्'),( 'प्h','फ्'),( 'ब्h','भ्'),
    # ekAkSaram
    ( 'h','ह्')]

sanHK['H'] = [
    # akSaratrayam
    ( 'ं H','म् ः'),
    #akSaradvayam
    ( 'क्H','क्ः'),( 'ख्H','ख्ः'),( 'ग्H','ग्ः'),( 'घ्H','घ्ः'),( 'ङ्H','ङ्ः'),( 'च्H','च्ः'),
    ( 'छ्H','छ्ः'),( 'ज्H','ज्ः'),( 'झ्H','झ्ः'),( 'ञ्H','ञ्ः'),( 'ट्H','ट्ः'),( 'ठ्H','ठ्ः'),( 'ड्H','ड्ः'),
    ( 'ढ्H','ढ्ः'),( 'ण्H','ण्ः'),( 'त्H','त्ः'),( 'थ्H','थ्ः'),( 'द्H','द्ः'),( 'ध्H','ध्ः'),( 'न्H','न्ः'),
    ( 'प्H','प्ः'),( 'फ्H','फ्ः'),( 'ब्H','ब्ः'),( 'भ्H','भ्ः'),( 'म्H','म्ः'),( 'य्H','य्ः'),( 'र्H','र्ः'),
    ( 'ल्H','ल्ः'),( 'व्H','व्ः'),( 'श्H','श्ः'),( 'ष्H','ष्ः'),( 'स्H','स्ः'),( 'ह्H','ह्ः'),( 'क्ष्H','क्ष्ः'),
    ( 'ज्ञ्H','ज्ञ्ः'),( 'ळ्H','ळ्ः'),
    # ekAkSaram
    ( 'H','ः')]

sanHK['i'] = [
    # akSaratrayam
    ( 'ं i','म् इ'),
    #akSaradvayam
    ( 'क्i','कि'),( 'ख्i','खि'),( 'ग्i','गि'),( 'घ्i','घि'),( 'ङ्i','ङि'),( 'च्i','चि'),( 'छ्i','छि'),
    ( 'ज्i','जि'),( 'झ्i','झि'),( 'ञ्i','ञि'),( 'ट्i','टि'),( 'ठ्i','ठि'),( 'ड्i','डि'),( 'ढ्i','ढि'),( 'ण्i','णि'),
    ( 'त्i','ति'),( 'थ्i','थि'),( 'द्i','दि'),( 'ध्i','धि'),( 'न्i','नि'),( 'प्i','पि'),( 'फ्i','फि'),( 'ब्i','बि'),
    ( 'भ्i','भि'),( 'म्i','मि'),( 'य्i','यि'),( 'र्i','रि'),( 'ल्i','लि'),( 'व्i','वि'),( 'श्i','शि'),( 'ष्i','षि'),
    ( 'स्i','सि'),( 'ह्i','हि'),( 'क्ष्i','क्षि'),( 'ज्ञ्i','ज्ञि'),( 'ळ्i','ळि'),
    ( 'इi','ई'),( 'किi','की'),( 'खिi','खी'),( 'गिi','गी'),( 'घिi','घी'),( 'ङिi','ङी'),( 'चिi','ची'),( 'छिi','छी'),
    ( 'जिi','जी'),( 'झिi','झी'),( 'ञिi','ञी'),( 'टिi','टी'),( 'ठिi','ठी'),( 'डिi','डी'),( 'ढिi','ढी'),( 'णिi','णी'),
    ( 'तिi','ती'),( 'थिi','थी'),( 'दिi','दी'),( 'धिi','धी'),( 'निi','नी'),( 'पिi','पी'),( 'फिi','फी'),( 'बिi','बी'),
    ( 'भिi','भी'),( 'मिi','मी'),( 'यिi','यी'),( 'रिi','री'),( 'लिi','ली'),( 'विi','वी'),( 'शिi','शी'),( 'षिi','षी'),
    ( 'सिi','सी'),( 'हिi','ही'),( 'क्षिi','क्षी'),( 'ज्ञिi','ज्ञी'),( 'ळिi','ळी'),
    ( 'अi','ऐ'),( 'कi','कै'),( 'खi','खै'),( 'गi','गै'),( 'घi','घै'),( 'ङi','ङै'),( 'चi','चै'),( 'छi','छै'),( 'जi','जै'),
    ( 'झi','झै'),( 'ञi','ञै'),( 'टi','टै'),( 'ठi','ठै'),( 'डi','डै'),( 'ढi','ढै'),( 'णi','णै'),( 'तi','तै'),( 'थi','थै'),
    ( 'दi','दै'),( 'धi','धै'),( 'नi','नै'),( 'पi','पै'),( 'फi','फै'),( 'बi','बै'),( 'भi','भै'),( 'मi','मै'),( 'यi','यै'),
    ( 'रi','रै'),( 'लi','लै'),( 'वi','वै'),( 'शi','शै'),( 'षi','षै'),( 'सi','सै'),( 'हi','है'),( 'क्षi','क्षै'),( 'ज्ञi','ज्ञै'),
    ( 'ळi','ळै'),
    # ekAkSaram
    ( 'i','इ')]

#  i - ityasya UrdhvAkSaram!
sanHK['I'] = [
    # akSaratrayam
    ( 'ं I','म् ई'),
    #akSaradvayam
    ( 'क्I','की'),( 'ख्I','खी'),( 'ग्I','गी'),( 'घ्I','घी'),( 'ङ्I','ङी'),( 'च्I','ची'),
    ( 'छ्I','छी'),( 'ज्I','जी'),( 'झ्I','झी'),( 'ञ्I','ञी'),( 'ट्I','टी'),( 'ठ्I','ठी'),( 'ड्I','डी'),
    ( 'ढ्I','ढी'),( 'ण्I','णी'),( 'त्I','ती'),( 'थ्I','थी'),( 'द्I','दी'),( 'ध्I','धी'),( 'न्I','नी'),
    ( 'प्I','पी'),( 'फ्I','फी'),( 'ब्I','बी'),( 'भ्I','भी'),( 'म्I','मी'),( 'य्I','यी'),( 'र्I','री'),
    ( 'ल्I','ली'),( 'व्I','वी'),( 'श्I','शी'),( 'ष्I','षी'),( 'स्I','सी'),( 'ह्I','ही'),( 'क्ष्I','क्षी'),
    ( 'ज्ञ्I','ज्ञी'), ( 'ळ्I','ळी'),
    # ekAkSaram
    ( 'I','ई')]

sanHK['j'] = [
    # akSaratrayam
    ( 'म् j','ं ज्'),
    #akSaradvayam
    ( 'न्j', 'ञ्ज्' ),
    ( 'ंj', 'ञ्ज्' ),
    # ekAkSaram
    ( 'j','ज्')]

sanHK['J'] = [
    # akSaratrayam
    ( 'म् J','ं ञ्'),
    #akSaradvayam
    ('ज्J','ज्ञ्'),
    # ekAkSaram
    ( 'J','ञ्')]

sanHK['k'] = [
    # akSaratrayam
    ( 'म् k','ं क्'),
    # akSaradvayam
    ('ंk', 'ङ्क्'),
    ('न्k', 'ङ्क्'),
    # ekAkSaram
    ( 'k','क्')]

sanHK['K'] = [('K','')]  ## udAsInaM kuru

# el -  etat adharAkSaram!
sanHK['l'] = [
    ( 'म् l','ं ल्'),
    #akSaradvayam
    ( 'क्l','क्ल्'),( 'ख्l','ख्ल्'),( 'ग्l','ग्ल्'),( 'घ्l','घ्ल्'),( 'ङ्l','ङ्ल्'),( 'च्l','च्ल्'),
    ( 'छ्l','छ्ल्'),( 'ज्l','ज्ल्'),( 'झ्l','झ्ल्'),( 'ञ्l','ञ्ल्'),( 'ट्l','ट्ल्'),( 'ठ्l','ठ्ल्'),( 'ड्l','ड्ल्'),
    ( 'ढ्l','ढ्ल्'),( 'ण्l','ण्ल्'),( 'त्l','त्ल्'),( 'थ्l','थ्ल्'),( 'द्l','द्ल्'),( 'ध्l','ध्ल्'),( 'न्l','न्ल्'),
    ( 'प्l','प्ल्'),( 'फ्l','फ्ल्'),( 'ब्l','ब्ल्'),( 'भ्l','भ्ल्'),( 'म्l','म्ल्'),( 'य्l','य्ल्'),( 'र्l','र्ल्'),
    ( 'ल्l','ल्ल्'),( 'व्l','व्ल्'),( 'श्l','श्ल्'),( 'ष्l','ष्ल्'),( 'स्l','स्ल्'),( 'ह्l','ह्ल्'), ( 'क्ष्l','क्ष्ल्'),
    ( 'ज्ञ्l','ज्ञ्ल्'),
    # ekAkSaram
    ( 'l','ल्')]

sanHK['L'] = [( 'म् L','ं ळ्'),( 'L','ळ्')]
sanHK['m'] = [
    # akSaratrayam
    ( 'म् m','ं म्'),
    # akSaradvayam
    ( 'Om', u'\u0950'),
    # ekAkSaram
    ( 'm','म्')]

sanHK['M'] = [
    # akSaracatuStayam
    ( 'OM', u'\u0950'),
    # akSaratrayam
    ( 'ं M','म् ं'),
    # akSaradvayam
    ( 'क्M','क्ं'),( 'ख्M','ख्ं'),( 'ग्M','ग्ं'),( 'घ्M','घ्ं'),( 'ङ्M','ङ्ं'),( 'च्M','च्ं'),
    ( 'छ्M','छ्ं'),( 'ज्M','ज्ं'),( 'झ्M','झ्ं'),( 'ञ्M','ञ्ं'),( 'ट्M','ट्ं'),( 'ठ्M','ठ्ं'),( 'ड्M','ड्ं'),
    ( 'ढ्M','ढ्ं'),( 'ण्M','ण्ं'),( 'त्M','त्ं'),( 'थ्M','थ्ं'),( 'द्M','द्ं'),( 'ध्M','ध्ं'),( 'न्M','न्ं'),
    ( 'प्M','प्ं'),( 'फ्M','फ्ं'),( 'ब्M','ब्ं'),( 'भ्M','भ्ं'),( 'म्M','म्ं'),( 'य्M','य्ं'),( 'र्M','र्ं'),
    ( 'ल्M','ल्ं'),( 'व्M','व्ं'),( 'श्M','श्ं'),( 'ष्M','ष्ं'),( 'स्M','स्ं'),( 'ह्M','ह्ं'),( 'क्ष्M','क्ष्ं'),
    ( 'ज्ञ्M','ज्ञ्ं'),( 'ळ्M','ळ्ं'),
    # ekAkSaram
    ( 'M','ं')]

sanHK['n'] = [( 'म् n','ं न्'),( 'n','न्')]
sanHK['N'] = [( 'म् N','ं ण्'),( 'N','ण्')]

sanHK['o'] = [
    # akSaratrayam
    ( 'ं o','म् ओ'),
    #akSaradvayam
    ( 'क्o','को'),( 'ख्o','खो'),( 'ग्o','गो'),( 'घ्o','घो'),( 'ङ्o','ङो'),( 'च्o','चो'),
    ( 'छ्o','छो'),( 'ज्o','जो'),( 'झ्o','झो'),( 'ञ्o','ञो'),( 'ट्o','टो'),( 'ठ्o','ठो'),( 'ड्o','डो'),
    ( 'ढ्o','ढो'),( 'ण्o','णो'),( 'त्o','तो'),( 'थ्o','थो'),( 'द्o','दो'),( 'ध्o','धो'),( 'न्o','नो'),
    ( 'प्o','पो'),( 'फ्o','फो'),( 'ब्o','बो'),( 'भ्o','भो'),( 'म्o','मो'),( 'य्o','यो'),( 'र्o','रो'),
    ( 'ल्o','लो'),( 'व्o','वो'),( 'श्o','शो'),( 'ष्o','षो'),( 'स्o','सो'),( 'ह्o','हो'),( 'क्ष्o','क्षो'),
    ( 'ज्ञ्o','ज्ञो'),( 'ळ्o','ळो'),
    # ekAkSaram
    ( 'o','ओ')]

sanHK['O'] = [('O','O')]

sanHK['p'] = [
    # akSaratrayam
    ( 'म् p','ं प्'),
    #akSaradvayam
    ( 'न्p', 'म्प्' ),
    ( 'ंp', 'म्प्' ),
    # ekAkSaram
    ( 'p','प्')]

sanHK['P'] = [('P','')]  ## udAsInaM kuru
sanHK['q'] = [('q','')]  ## udAsInaM kuru
sanHK['Q'] = [('Q','')]  ## udAsInaM kuru
sanHK['r'] = [( 'म् r','ं र्'),( 'r','र्')]

sanHK['R'] = [
    # akSaracatuSTayam
    ( 'ं ल्R','म् ऌ'),
    # akSaratrayam
    ( 'ं R','म् ऋ'),
    #akSaradvayam
    ( 'क्R','कृ'),( 'ख्R','खृ'),( 'ग्R','गृ'),( 'घ्R','घृ'),( 'ङ्R','ङृ'),( 'च्R','चृ'),
    ( 'छ्R','छृ'),( 'ज्R','जृ'),( 'झ्R','झृ'),( 'ञ्R','ञृ'),( 'ट्R','टृ'),( 'ठ्R','ठृ'),( 'ड्R','डृ'),
    ( 'ढ्R','ढृ'),( 'ण्R','णृ'),( 'त्R','तृ'),( 'थ्R','थृ'),( 'द्R','दृ'),( 'ध्R','धृ'),( 'न्R','नृ'),
    ( 'प्R','पृ'),( 'फ्R','फृ'),( 'ब्R','बृ'),( 'भ्R','भृ'),( 'म्R','मृ'),( 'य्R','यृ'),( 'र्R','रृ'),
    ( 'ल्R','ऌ'),( 'व्R','वृ'),( 'श्R','शृ'),( 'ष्R','षृ'),( 'स्R','सृ'),( 'ह्R','हृ'),( 'क्ष्R','क्षृ'),
    ( 'ज्ञ्R','ज्ञृ'),( 'ळ्R','ळृ'),( 'ऋR','ॠ'),
    ( 'कृR','कॄ'),( 'खृR','खॄ'),( 'गृR','गॄ'),( 'घृR','घॄ'),( 'ङृR','ङॄ'),
    ( 'चृR','चॄ'),( 'छृR','छॄ'),( 'जृR','जॄ'),( 'झृR','झॄ'),( 'ञृR','ञॄ'),( 'टृR','टॄ'),( 'ठृR','ठॄ'),
    ( 'डृR','डॄ'),( 'ढृR','ढॄ'),( 'णृR','णॄ'),( 'तृR','तॄ'),( 'थृR','थॄ'),( 'दृR','दॄ'),( 'धृR','धॄ'),
    ( 'नृR','नॄ'),( 'पृR','पॄ'),( 'फृR','फॄ'),( 'बृR','बॄ'),( 'भृR','भॄ'),( 'मृR','मॄ'),( 'यृR','यॄ'),
    ( 'रृR','रॄ'),( 'ऌR','ॡ'),( 'वृR','वॄ'),( 'शृR','शॄ'),( 'षृR','षॄ'),( 'सृR','सॄ'),( 'हृR','हॄ'),
    ( 'क्षृR','क्षॄ'),( 'ज्ञृR','ज्ञॄ'),( 'ळृR','ळॄ'),
    ( 'क्ल्R','कॢ'),( 'ख्ल्R','खॢ'),( 'ग्ल्R','गॢ'),( 'घ्ल्R','घॢ'),( 'ङ्ल्R','ङॢ'),( 'च्ल्R','चॢ'),
    ( 'छ्ल्R','छॢ'),( 'ज्ल्R','जॢ'),( 'झ्ल्R','झॢ'),( 'ञ्ल्R','ञॢ'),( 'ट्ल्R','टॢ'),( 'ठ्ल्R','ठॢ'),
    ( 'ड्ल्R','डॢ'),( 'ढ्ल्R','ढॢ'),( 'ण्ल्R','णॢ'),( 'त्ल्R','तॢ'),( 'थ्ल्R','थॢ'),( 'द्ल्R','दॢ'),
    ( 'ध्ल्R','धॢ'),( 'न्ल्R','नॢ'),( 'प्ल्R','पॢ'),( 'फ्ल्R','फॢ'),( 'ब्ल्R','बॢ'),( 'भ्ल्R','भॢ'),
    ( 'म्ल्R','मॢ'),( 'य्ल्R','यॢ'),( 'र्ल्R','रॢ'),( 'ल्ल्R','लॢ'),( 'व्ल्R','वॢ'),( 'श्ल्R','शॢ'),
    ( 'ष्ल्R','षॢ'),( 'स्ल्R','सॢ'),( 'ह्ल्R','हॢ'),
    ( 'क्ष्ल्R','क्षॢ'),( 'ज्ञ्ल्R','ज्ञॢ'),( 'ळ्ल्R','ळॢ'),
    ( 'कॢR','कॣ'),( 'खॢR','खॣ'),( 'गॢR','गॣ'),( 'घॢR','घॣ'),( 'ङॢR','ङॣ'),( 'चॢR','चॣ'),( 'छॢR','छॣ'),
    ( 'जॢR','जॣ'),( 'झॢR','झॣ'),( 'ञॢR','ञॣ'),( 'टॢR','टॣ'),( 'ठॢR','ठॣ'),( 'डॢR','डॣ'),( 'ढॢR','ढॣ'),
    ( 'णॢR','णॣ'),( 'तॢR','तॣ'),( 'थॢR','थॣ'),( 'दॢR','दॣ'),( 'धॢR','धॣ'),( 'नॢR','नॣ'),( 'पॢR','पॣ'),
    ( 'फॢR','फॣ'),( 'बॢR','बॣ'),( 'भॢR','भॣ'),( 'मॢR','मॣ'),( 'यॢR','यॣ'),( 'रॢR','रॣ'),( 'लॢR','लॣ'),
    ( 'वॢR','वॣ'),( 'शॢR','शॣ'),( 'षॢR','षॣ'),( 'सॢR','सॣ'),( 'हॢR','हॣ'),( 'क्षॢR','क्षॣ'),( 'ज्ञॢR','ज्ञॣ'),
    ( 'ळॢR','ळॣ'),
    # ekAkSaram
    ( 'R','ऋ')]

sanHK['s'] = [( 'म् s','ं स्'),( 's','स्')]
sanHK['S'] = [( 'म् S','ं ष्'),( 'क्S','क्ष्'), ( 'S','ष्')]
sanHK['t'] = [
    # akSaratrayam
    ( 'म् t','ं त्'),
    #akSaradvayam
    ( 'न्t', 'न्त्' ),
    ( 'ंt', 'न्त्' ),
    # ekAkSaram
    ( 't','त्')]

sanHK['T'] = [
    # akSaratrayam
    ( 'म् T','ं ट्'),
    #akSaradvayam
    ( 'न्T', 'ण्ट्' ),
    ( 'ंT', 'ण्ट्' ),
    # ekAkSaram
    ( 'T','ट्')]

sanHK['u'] = [
    # akSaratrayam
    ( 'ं u','म् उ'),
    #akSaradvayam
    ( 'क्u','कु'),( 'ख्u','खु'),( 'ग्u','गु'),( 'घ्u','घु'),( 'ङ्u','ङु'),( 'च्u','चु'),
    ( 'छ्u','छु'),( 'ज्u','जु'),( 'झ्u','झु'),( 'ञ्u','ञु'),( 'ट्u','टु'),( 'ठ्u','ठु'),( 'ड्u','डु'),
    ( 'ढ्u','ढु'),( 'ण्u','णु'),( 'त्u','तु'),( 'थ्u','थु'),( 'द्u','दु'),( 'ध्u','धु'),( 'न्u','नु'),
    ( 'प्u','पु'),( 'फ्u','फु'),( 'ब्u','बु'),( 'भ्u','भु'),( 'म्u','मु'),( 'य्u','यु'),( 'र्u','रु'),
    ( 'ल्u','लु'),( 'व्u','वु'),( 'श्u','शु'),( 'ष्u','षु'),( 'स्u','सु'),( 'ह्u','हु'),( 'क्ष्u','क्षु'),
    ( 'ज्ञ्u','ज्ञु'), ( 'ळ्u','ळु'),
    ( 'उu','ऊ'),( 'कुu','कू'),( 'खुu','खू'),( 'गुu','गू'),( 'घुu','घू'),( 'ङुu','ङू'),( 'चुu','चू'),
    ( 'छुu','छू'),( 'जुu','जू'),( 'झुu','झू'),( 'ञुu','ञू'),( 'टुu','टू'),( 'ठुu','ठू'),( 'डुu','डू'),
    ( 'ढुu','ढू'),( 'णुu','णू'),( 'तुu','तू'),( 'थुu','थू'),( 'दुu','दू'),( 'धुu','धू'),( 'नुu','नू'),
    ( 'पुu','पू'),( 'फुu','फू'),( 'बुu','बू'),( 'भुu','भू'),( 'मुu','मू'),( 'युu','यू'),( 'रुu','रू'),
    ( 'लुu','लू'),( 'वुu','वू'),( 'शुu','शू'),( 'षुu','षू'),( 'सुu','सू'),( 'हुu','हू'),( 'क्षुu','क्षू'),
    ( 'ज्ञुu','ज्ञू'),( 'ळुu','ळू'),
    ( 'अu','औ'),( 'कu','कौ'),( 'खu','खौ'),( 'गu','गौ'),( 'घu','घौ'),
    ( 'ङu','ङौ'),( 'चu','चौ'),( 'छu','छौ'),( 'जu','जौ'),( 'झu','झौ'),( 'ञu','ञौ'),
    ( 'टu','टौ'),( 'ठu','ठौ'),( 'डu','डौ'),( 'ढu','ढौ'),( 'णu','णौ'),( 'तu','तौ'),( 'थu','थौ'),
    ( 'दu','दौ'),( 'धu','धौ'),( 'नu','नौ'),( 'पu','पौ'),( 'फu','फौ'),( 'बu','बौ'),( 'भu','भौ'),
    ( 'मu','मौ'),( 'यu','यौ'),( 'रu','रौ'),( 'लu','लौ'),( 'वu','वौ'),( 'शu','शौ'),( 'षu','षौ'),
    ( 'सu','सौ'),( 'हu','हौ'),( 'क्षu','क्षौ'),( 'ज्ञu','ज्ञौ'), ( 'ळu','ळौ'),
    # ekAkSaram
    ( 'u','उ')]

sanHK['U'] = [
    # akSaratrayam
    ( 'ं U','म् ऊ'),
    #akSaradvayam
    ( 'क्U','कू'),( 'ख्U','खू'),( 'ग्U','गू'),( 'घ्U','घू'),( 'ङ्U','ङू'),( 'च्U','चू'),
    ( 'छ्U','छू'),( 'ज्U','जू'),( 'झ्U','झू'),( 'ञ्U','ञू'),( 'ट्U','टू'),( 'ठ्U','ठू'),( 'ड्U','डू'),
    ( 'ढ्U','ढू'),( 'ण्U','णू'),( 'त्U','तू'),( 'थ्U','थू'),( 'द्U','दू'),( 'ध्U','धू'),( 'न्U','नू'),
    ( 'प्U','पू'),( 'फ्U','फू'),( 'ब्U','बू'),( 'भ्U','भू'),( 'म्U','मू'),( 'य्U','यू'),( 'र्U','रू'),
    ( 'ल्U','लू'),( 'व्U','वू'),( 'श्U','शू'),( 'ष्U','षू'),( 'स्U','सू'),( 'ह्U','हू'),( 'क्ष्U','क्षू'),
    ( 'ज्ञ्U','ज्ञू'),( 'ळ्U','ळू'),( 'ळ्U','ळू'),
    # ekAkSaram
    ( 'U','ऊ')]

sanHK['v'] = [( 'म् v','ं व्'),( 'v','व्')]
sanHK['V'] = [('V','')]  ## udAsInaM kuru
sanHK['w'] = [('w','')]  ## udAsInaM kuru
sanHK['W'] = [('W','')]  ## udAsInaM kuru
sanHK['x'] = [('x','')]  ## udAsInaM kuru
sanHK['X'] = [('X','')]  ## udAsInaM kuru

sanHK['y'] = [
    # akSaratrayam
    ( 'म् y','ं य्'),
    # ekAkSaram
    ( 'y','य्')]

sanHK['Y'] = [('Y','')]  ## udAsInaM kuru
sanHK['z'] = [( 'म् z','ं श्'),( 'z','श्')]
sanHK['Z'] = [('Z','')]  ## udAsInaM kuru
sanHK['0'] = [('0',u'\u0966')]
sanHK['1'] = [('1',u'\u0967')]
sanHK['2'] = [('2',u'\u0968')]
sanHK['3'] = [('3',u'\u0969')]
sanHK['4'] = [('4',u'\u096A')]
sanHK['5'] = [('5',u'\u096B')]
sanHK['6'] = [('6',u'\u096C')]
sanHK['7'] = [('7',u'\u096D')]
sanHK['8'] = [('8',u'\u096E')]
sanHK['9'] = [('9',u'\u096F')]

## lekhanacihnam
sanHK['exclam'] = [( 'ं !', 'म् !')]
sanHK['quotedbl'] = [( r'ं "', r'म् "')]
sanHK['numbersign']=[( 'ं #', 'म् #')]
sanHK['dollar']=[( 'ं $', 'म् $')]
sanHK['percent']=[( 'ं %', 'म् %')]
sanHK['quoteright']=[( "ं '", "म् '")]
sanHK['parenleft']=[( 'ं (', 'म् (')]
sanHK['parenright']=[( 'ं )', 'म् )')]
sanHK['asterisk']=[( 'ं *', 'म् *')]
sanHK['plus']=[( 'ं +', 'म् +')]
sanHK['comma']=[( 'ं ,', 'म् ,'),( 'ं,', 'म्,')]
sanHK['minus']=[( 'ं -', 'म् -')]
sanHK['period']=[( 'ं .', 'म् .'),    ( 'ं.', 'म्.')]
sanHK['slash']=[( 'ं /', 'म् /')]
sanHK['colon']=[( 'ं :', 'म् :')]
sanHK['semicolon']=[( 'ं ;', 'म् ;')]
sanHK['less']=[( 'ं <', 'म् <')]
sanHK['equal']=[( 'ं =', 'म् =')]
sanHK['greater']=[( 'ं >', 'म् >')]
sanHK['question']=[( 'ं ?', 'म् ?')]
sanHK['at']=[( 'ं @', 'म् @')]
sanHK['bracketleft']=[( 'ं [', 'म् [')]
sanHK['backslash']=[( 'ं \\', 'म् \\')]
sanHK['bracketright']=[( 'ं ]', 'म् ]')]
sanHK['asciicircum']=[( 'ं ^', 'म् ^')]
sanHK['underscore']=[( 'ं _', 'म् _')]
sanHK['quoteleft']=[( 'ं `', 'म् `')]
sanHK['braceleft']=[( 'ं {', 'म् {')]
## daNDaH, dvidaNDaH
sanHK['bar'] = [
    # akSaratrayam
    ('ं '+'|','म् '+'।'),
    #akSaradvayam
    ('ं'+'|','म्'+'।'),
    ('।|', '॥'),
    # ekAkSaram
    ('|', '।')]
sanHK['braceright']=[( 'ं }', 'म् }')]
sanHK['asciitilde']=[( 'ं ~', 'म् ~')]
sanHK['ampersand'] = [('&',u'\u093D')]  ## Avagraha

#--------------------------------------------------------------------------------
# replace <lhs> with <rhs> on the rightmost end of string. 
def rreplace( s, old, new ):
    li = s.rsplit( old, 1 )
    return new.join( li )
#--------------------------------------------------------------------------------
def sanHK_parivRtyatAm( ghaTanaAkS, zRGkhalA ):
    for i in range( len( sanHK[ ghaTanaAkS ] )):
        anitya_zRG = rreplace(zRGkhalA, sanHK[ghaTanaAkS][i][0], sanHK[ghaTanaAkS][i][1] )
        if anitya_zRG != zRGkhalA:
            return anitya_zRG
    return zRGkhalA
#--------------------------------------------------------------------------------

'''
Documentation-to-do: (nothing outstanding)
kaMkatam -> kaGkatam (i.e., from sAdAraNasaMskRtam to suddhasaMskrtam)
i.e, saMy->samy, saMr->samr, saMl ->saml, saMv->samv, sams->saMs, saGjJ, samjJ->saMjJ,

backspace - should reverse exactly what was typed previously. not just one ucode point
'''
